import img1_png from '@assets/images/Stocks/1.png'
import img2_png from '@assets/images/Stocks/2.png'
import img3_png from '@assets/images/Stocks/3.png'
import img4_png from '@assets/images/Stocks/4.png'
import img5_png from '@assets/images/Stocks/5.png'
import img6_png from '@assets/images/Stocks/6.png'
import img7_png from '@assets/images/Stocks/7.png'
import img8_png from '@assets/images/Stocks/8.png'
import img9_png from '@assets/images/Stocks/9.png'

import img1_webp from '@assets/images/Stocks/1.webp'
import img2_webp from '@assets/images/Stocks/2.webp'
import img3_webp from '@assets/images/Stocks/3.webp'
import img4_webp from '@assets/images/Stocks/4.webp'
import img5_webp from '@assets/images/Stocks/5.webp'
import img6_webp from '@assets/images/Stocks/6.webp'
import img7_webp from '@assets/images/Stocks/7.webp'
import img8_webp from '@assets/images/Stocks/8.webp'
import img9_webp from '@assets/images/Stocks/9.webp'

import img1_avif from '@assets/images/Stocks/1.avif'
import img2_avif from '@assets/images/Stocks/2.avif'
import img3_avif from '@assets/images/Stocks/3.avif'
import img4_avif from '@assets/images/Stocks/4.avif'
import img5_avif from '@assets/images/Stocks/5.avif'
import img6_avif from '@assets/images/Stocks/6.avif'
import img7_avif from '@assets/images/Stocks/7.avif'
import img8_avif from '@assets/images/Stocks/8.avif'
import img9_avif from '@assets/images/Stocks/9.avif'

export const cards = [
  {
    source: [
      { srcSet: img1_avif, type: 'image/avif' },
      { srcSet: img1_webp, type: 'image/webp' },
    ],
    png: img1_png,
    alt: 'Гарантия качества',
    text: 'Акция - «Гарантия качества»',
  },
  {
    source: [
      { srcSet: img2_avif, type: 'image/avif' },
      { srcSet: img2_webp, type: 'image/webp' },
    ],
    png: img2_png,
    alt: 'Счастливые часы',
    text: 'Акция - «Счастливые часы 10%»',
  },
  {
    source: [
      { srcSet: img3_avif, type: 'image/avif' },
      { srcSet: img3_webp, type: 'image/webp' },
    ],
    png: img3_png,
    alt: 'Подарок за отзыв',
    text: 'Акция - «Подарки за отзыв»',
  },
  {
    source: [
      { srcSet: img4_avif, type: 'image/avif' },
      { srcSet: img4_webp, type: 'image/webp' },
    ],
    png: img4_png,
    alt: 'Топпинг Оплачивается отдельно',
    text: 'Внимание - Топпинги',
  },
  {
    source: [
      { srcSet: img5_avif, type: 'image/avif' },
      { srcSet: img5_webp, type: 'image/webp' },
    ],
    png: img5_png,
    alt: 'Подарок к заказу',
    text: 'Акция - «Подарок к первому заказу»',
  },
  {
    source: [
      { srcSet: img6_avif, type: 'image/avif' },
      { srcSet: img6_webp, type: 'image/webp' },
    ],
    png: img6_png,
    alt: 'Пицца за 1 рубль',
    text: 'Акция - «Пицца за 1₽»',
  },
  {
    source: [
      { srcSet: img7_avif, type: 'image/avif' },
      { srcSet: img7_webp, type: 'image/webp' },
    ],
    png: img7_png,
    alt: 'Получай кешбэк',
    text: 'Акция - «Кэшбэк»',
  },
  {
    source: [
      { srcSet: img8_avif, type: 'image/avif' },
      { srcSet: img8_webp, type: 'image/webp' },
    ],
    png: img8_png,
    alt: 'Самовывоз скидка 10%',
    text: 'Акция - «Самовывоз»',
  },
  {
    source: [
      { srcSet: img9_avif, type: 'image/avif' },
      { srcSet: img9_webp, type: 'image/webp' },
    ],
    png: img9_png,
    alt: 'Подарок на день рождения',
    text: 'Акция - «День рождения»',
  },
]

export const textModal = [
  `
    Мы всегда на твоей стороне и в ответе за качество нашей продукции Если 
    курьер привез некачественный заказ, в течение 30 минут после получения 
    позвони и сообщи причину возврата/замены оператору. Мы заменим не 
    понравившийся товар или вернем деньги. Для возврата денег или замены 
    заказа, необходимо вернуть не менее 90% продукции.
   `,
  `
    Дарим скидку 10% по промокоду СЧ10 по будням с 11:00 до 16:00. Минимальная 
    сумма заказа 999 рублей. Скидка 10% действует на всё меню ресторана 
    доставки «Джонни Тунец», кроме комбо-наборов. Акция не суммируется с 
    другими акциями, подарками и промокодами. Скидка 10% по акции не 
    суммируется со скидкой за самовывоз. Акция действует в будние дни с 
    понедельника по пятницу с 13:00 до 16:00. Акция не действует в праздничные 
    дни. Заказ, оформленный со скидкой по акции, можно получить не позднее 
    16:00.
  `,
  `
    📝 Оставь отзыв = получи ролл. 🎁 Дарим ролл Воздушный с цыплёнком к 
    заказу от 1090₽ за отзыв на картах Яндекс, 2ГИС. Просто найдите нашу 
    компанию на карте и оставьте свой отзыв. Сделайте скриншот и пришлите в 
    сообщения группы для получения промокода! Мы на Яндекс картах: 
    https://vk.cc/cMy0zl. Мы в 2ГИС: https://vk.cc/cMy0Ka. Наш администратор 
    выдаст вам промокод. Если сообщения потерялись - перешлите их снова. 1) 
    Промокод действует один раз! 2) Негативные отзывы в конкурсе не участвуют! 
    3) Действует только при заказе онлайн!
  `,
  `
    Джонни Тунец понимает каждого. Она предпочитает имбирь, а ему нужно больше 
    васаби. Чтобы цены на ваши любимые роллы оставались на комфортном 
    привычном уровне, Джонни отделил соусы и топпинги и установил на них цену, 
    близкую к себестоимости. Добавьте столько, сколько хотите именно Вы.
  `,
  `
    Новым гостям подарок к первому заказу по промокоду 555 роллы мистер крабс 
    в подарок. Действует от 999₽.
  `,
  `
    При заказе 2-х пицц 35см , пицца Ранч 23см всего за 1₽ к заказу. При 
    заказе 2-х пицц 40см , пицца неппепперони 23см всего за 1₽ к заказу
  `,
  `
    При каждом заказе вы получаете 5% от суммы заказа кэшбэк. При достижении 
    общей суммы заказов более 10.000₽ , кэшбэк составит 10% от суммы заказа. 
    Бонусные рубли можно списать только до мин суммы заказа 600 рублей. 
    Подробнее в разделе "Бонусная программа".
  `,
  `
    Забери свой заказ с точки и получи 10 % скидку.
  `,
  `
    Скидка 15% на заказы от 3000₽ по промокоду ДР15. Пицца цыпленок барбекю 
    35см в подарок к заказу от 2000₽. Необходимого предъявить документ для 
    использования скидки и подарка. Действует 3 дня до и 3 дня после дня 
    рождения. Профиль должен быть заполнен, обязательно.
  `,
]
