export const cities = [
  { value: 'kaliningrad', label: 'Калининград' },
  { value: 'krasnodar', label: 'Краснодар' },
  { value: 'moscow', label: 'Москва' },
  { value: 'saint-petersburg', label: 'Санкт-Петербург' },
]

export const delivery = [
  {
    paragraph: 'Минимальный заказ',
    title: 'от 600 ₽',
  },
  {
    paragraph: 'Время приготовления',
    title: 'от 30 мин',
  },
  {
    paragraph: 'Бесплатная доставка',
    title: 'от 700 ₽',
  },
  {
    paragraph: 'Время доставки',
    title: 'от 45 мин',
  },
]

export const information = [
  `Настоящий документ содержит условия и правила, регулирующие порядок 
  использования веб-сайта, а также общие положения, касающиеся прав и 
  обязанностей пользователей и администрации. Вся представленная информация 
  носит справочный характер и не является исчерпывающей. Используя сайт, 
  пользователь подтверждает согласие с приведёнными условиями и обязуется 
  соблюдать их в полном объёме.`,

  `Пользователь осознаёт, что любые материалы, опубликованные на данном ресурсе,
  могут быть изменены, удалены или дополнены без предварительного уведомления.
  Администрация оставляет за собой право приостанавливать доступ к сайту для
  проведения технических работ или обновления контента.`,

  `Все тексты, изображения, мультимедийные материалы, логотипы, элементы дизайна
  и программные компоненты являются объектами авторского права и охраняются 
  действующим законодательством. Использование информации, представленной на 
  сайте, допускается исключительно в личных и некоммерческих целях. Любое 
  копирование, распространение или модификация материалов возможны только при 
  наличии письменного разрешения правообладателя.`,

  `Пользователь обязуется не предпринимать действий, способных нанести ущерб 
  сайту, его функционалу, а также репутации администрации. Запрещается 
  использовать сайт для распространения спама, размещения вредоносных программ,
  сбора персональных данных третьих лиц и иных противоправных целей.`,

  `Администрация сайта не несёт ответственности за возможные сбои, ошибки, 
  временную недоступность ресурса или утрату данных. В то же время 
  предпринимаются все разумные меры для обеспечения бесперебойной работы и 
  сохранности информации.`,

  `В случае возникновения спорных ситуаций стороны стремятся урегулировать их 
  путём переговоров. Если договориться не удаётся, спор подлежит рассмотрению в 
  соответствии с действующим законодательством по месту нахождения администрации
  ресурса.`,

  `Использование сайта означает безусловное согласие пользователя с настоящими
   условиями. Если пользователь не согласен с какими-либо положениями, он обязан
   немедленно прекратить использование ресурса.`,

  `Настоящий текст может быть изменён, дополнен или обновлён в любое время без 
  предварительного уведомления. Рекомендуется периодически проверять 
  актуальность документа, чтобы быть в курсе возможных изменений.`,

  `Настоящий документ устанавливает правила и условия использования сайта, а 
  также регулирует порядок обработки персональных данных, защиту информации и 
  распределение ответственности между администрацией и пользователями ресурса. 
  Все положения направлены на обеспечение корректного функционирования сайта, 
  соблюдение законодательства и защиту прав как пользователей, так и 
  правообладателей.`,

  `Пользователь обязуется использовать сайт исключительно в законных целях, не 
  предпринимать действий, которые могут привести к нарушению работы ресурса, 
  утечке данных, повреждению программного обеспечения или нанесению ущерба 
  репутации администрации. Запрещается размещение вредоносного кода, 
  использование автоматизированных систем для сбора информации, рассылка спама и
  любые иные действия, способные негативно повлиять на работу сайта.`,

  `Администрация оставляет за собой право вносить изменения в содержание сайта, 
  его структуру и функционал без предварительного уведомления. Временное 
  ограничение доступа возможно при проведении профилактических или технических 
  работ, обновлении программного обеспечения или внедрении новых функций. 
  Пользователи уведомляются о таких изменениях по мере возможности, однако факт 
  временной недоступности не является нарушением обязательств со стороны 
  администрации.`,

  `Все материалы, опубликованные на сайте, включая тексты, изображения, 
  логотипы, элементы дизайна и программный код, охраняются законодательством об 
  авторском праве. Их использование допускается исключительно в личных и 
  некоммерческих целях. Любое копирование, распространение, модификация или 
  коммерческое применение материалов возможно только при наличии письменного 
  разрешения правообладателя.`,

  `Персональные данные, предоставляемые пользователями при заполнении форм или 
  использовании функционала сайта, обрабатываются в соответствии с действующим 
  законодательством о защите персональной информации. Администрация 
  предпринимает необходимые технические и организационные меры для 
  предотвращения несанкционированного доступа, утраты или изменения данных. 
  Передача информации третьим лицам осуществляется только в случаях, прямо 
  предусмотренных законом.`,

  `Сайт может содержать ссылки на сторонние ресурсы. Администрация не несёт 
  ответственности за содержание, доступность и безопасность таких ресурсов, а 
  также за последствия, которые могут возникнуть в результате их использования. 
  Переходя по внешним ссылкам, пользователь принимает на себя все риски, 
  связанные с использованием сторонних сайтов.`,

  `В случае возникновения спорных ситуаций стороны обязуются предпринять попытку
   урегулирования конфликта в досудебном порядке путём переговоров и обмена 
   официальной перепиской. При невозможности достижения соглашения спор подлежит
   рассмотрению в суде по месту нахождения администрации ресурса в соответствии 
   с действующим законодательством.`,

  `Использование сайта означает полное и безусловное согласие пользователя с 
  настоящими условиями. Если пользователь не принимает данные правила или 
  какие-либо отдельные положения, он обязан немедленно прекратить использование 
  ресурса. Настоящий текст может быть изменён, дополнен или обновлён 
  администрацией в любое время без предварительного уведомления. Рекомендуется 
  регулярно знакомиться с актуальной редакцией документа, чтобы быть в курсе 
  возможных изменений.`,
]

export const stocks = [
  `
    Мы всегда на твоей стороне и в ответе за качество нашей продукции Если 
    курьер привез некачественный заказ, в течение 30 минут после получения 
    позвони и сообщи причину возврата/замены оператору. Мы заменим не 
    понравившийся товар или вернем деньги. Для возврата денег или замены 
    заказа, необходимо вернуть не менее 90% продукции.
   `,
  `
    Дарим скидку 10% по промокоду СЧ10 по будням с 11:00 до 16:00. Минимальная 
    сумма заказа 999 рублей. Скидка 10% действует на всё меню ресторана 
    доставки «Джонни Тунец», кроме комбо-наборов. Акция не суммируется с 
    другими акциями, подарками и промокодами. Скидка 10% по акции не 
    суммируется со скидкой за самовывоз. Акция действует в будние дни с 
    понедельника по пятницу с 13:00 до 16:00. Акция не действует в праздничные 
    дни. Заказ, оформленный со скидкой по акции, можно получить не позднее 
    16:00.
  `,
  `
    📝 Оставь отзыв = получи ролл. 🎁 Дарим ролл Воздушный с цыплёнком к 
    заказу от 1090₽ за отзыв на картах Яндекс, 2ГИС. Просто найдите нашу 
    компанию на карте и оставьте свой отзыв. Сделайте скриншот и пришлите в 
    сообщения группы для получения промокода! Мы на Яндекс картах: 
    https://vk.cc/cMy0zl. Мы в 2ГИС: https://vk.cc/cMy0Ka. Наш администратор 
    выдаст вам промокод. Если сообщения потерялись - перешлите их снова. 1) 
    Промокод действует один раз! 2) Негативные отзывы в конкурсе не участвуют! 
    3) Действует только при заказе онлайн!
  `,
  `
    Джонни Тунец понимает каждого. Она предпочитает имбирь, а ему нужно больше 
    васаби. Чтобы цены на ваши любимые роллы оставались на комфортном 
    привычном уровне, Джонни отделил соусы и топпинги и установил на них цену, 
    близкую к себестоимости. Добавьте столько, сколько хотите именно Вы.
  `,
  `
    Новым гостям подарок к первому заказу по промокоду 555 роллы мистер крабс 
    в подарок. Действует от 999₽.
  `,
  `
    При заказе 2-х пицц 35см , пицца Ранч 23см всего за 1₽ к заказу. При 
    заказе 2-х пицц 40см , пицца неппепперони 23см всего за 1₽ к заказу
  `,
  `
    При каждом заказе вы получаете 5% от суммы заказа кэшбэк. При достижении 
    общей суммы заказов более 10.000₽ , кэшбэк составит 10% от суммы заказа. 
    Бонусные рубли можно списать только до мин суммы заказа 600 рублей. 
    Подробнее в разделе "Бонусная программа".
  `,
  `
    Забери свой заказ с точки и получи 10 % скидку.
  `,
  `
    Скидка 15% на заказы от 3000₽ по промокоду ДР15. Пицца цыпленок барбекю 
    35см в подарок к заказу от 2000₽. Необходимого предъявить документ для 
    использования скидки и подарка. Действует 3 дня до и 3 дня после дня 
    рождения. Профиль должен быть заполнен, обязательно.
  `,
]
